/************************************************************************************/
/*					Модуль для работы с FIFO буфером								*/
/*					(размер буфера 2^n (n = 1..16))									*/
/************************************************************************************/
#include "FIFO_BUF.h"

/*==================================================================================*/
/* Константы																		*/
/*==================================================================================*/
/*==================================================================================*/
/* Глобальные переменные															*/
/*==================================================================================*/
/*==================================================================================*/
/* Прототипы																		*/
/*==================================================================================*/
void			FIFO_Init 	(TFIFO_BUF *fifo, volatile unsigned char *buf, unsigned short fifo_size);
unsigned short	FIFO_Put 	(TFIFO_BUF *fifo, volatile unsigned char* data, unsigned short len);
unsigned short	FIFO_Get	(TFIFO_BUF *fifo, volatile unsigned char* data, unsigned short len);

/*==================================================================================*/
/* Инициализация буфера																*/
/*	Входные параметры:																*/
/*		fifo - указатель на струтуру FIFO буфера 									*/
/*		buf - указатель на буфер для данных											*/
/*		fifo_size - размер буфера для данных (должен быть 2^n)						*/
/*	Выходные параметры:	нет															*/
/*==================================================================================*/
void FIFO_Init (TFIFO_BUF* fifo, volatile unsigned char *buf, unsigned short fifo_size)
{
// Локальные переменные
// Программа
// Инициализация параметров FIFO буфера
	fifo->size = fifo_size;
	fifo->mask = fifo_size - 1;
	fifo->data = buf;
// Инициализация указателей
	FIFO_CLEAR(fifo);
}

/*==================================================================================*/
/* Помещение данных в буфер															*/
/*	Входные параметры:																*/
/*		fifo - указатель на струтуру FIFO буфера 									*/
/*		data - указатель на данные													*/
/*		len  - количество байт данных для помещения в буфер							*/
/*	Выходные параметры:	количество байт данных, записанных в буфер					*/
/*==================================================================================*/
unsigned short FIFO_Put (TFIFO_BUF* fifo, volatile unsigned char* data, unsigned short len)
{
// Локальные переменные
	unsigned short	free_cnt;	// количество свободных записей в буфере
	unsigned short	wr_cnt = 0;	// количество данных записанных в буфер
// Программа
// Получение размера свободного места в буфере
	free_cnt = FIFO_FREE(fifo);
// Проверка достаточности свободного места
	if (free_cnt < len)
		len = free_cnt;
// Помещение всех данных в буфер
	while (len--)
	{
	// Помещение байта данных в буфер
		fifo->data[fifo->wr++] = *data++;
	// Проверка на достижение верхней границы буфера
		fifo->wr &= fifo->mask;
	// Обновление количества записанных байт данных
		wr_cnt++;
	}
// Возвращение количества данных помещенных в буфер
	return wr_cnt;
}

/*==================================================================================*/
/* Считывание данных из буфера														*/
/*	Входные параметры:																*/
/*		fifo - указатель на струтуру FIFO буфера 									*/
/*		data - указатель на данные													*/
/*		len  - количество байт данных для помещения в буфер							*/
/*	Выходные параметры:	количество байт данных, записанных в буфер					*/
/*==================================================================================*/
unsigned short FIFO_Get (TFIFO_BUF* fifo, volatile unsigned char* data, unsigned short len)
{
// Локальные переменные
	unsigned short	avail_cnt;	// количество байт данных доступных в буфере
	unsigned short	rd_cnt = 0;	// количество данных считанных из буфера
// Программа
// Получение размера доступных данных
	avail_cnt = FIFO_AVAIL(fifo);
// Проверка наличия данных в буфере
	if (avail_cnt < len)
		len = avail_cnt;
// Извлечение данных из буфера
	while (len--)
	{
	// Считывание очередного байта данных
		*data++ = fifo->data[fifo->rd++];
	// Проверка на достижение верхней границы буфера
		fifo->rd &= fifo->mask;
	// Обновление количества прочитанных байт данных
		rd_cnt++;
	}
// Количество прочитанных байт данных
	return rd_cnt;
}

/*==================================================================================*/
