/*
 * position.c
 *
 *  Created on: 02.02.2011
 *      Author: 129
 */
#include "ctrlpwm.h"
#include "pwm.h"
#include "position.h"

// переменные
TPOS 		Pos;
TCFG		Config;
TEvent		Events[SIZE_OF_EVENTS]; // буфер хранени€ событий
TEventPnt	EventPnt;				// указатели на событи€

//--------------------------------------------------------------
//‘Ќ„
// инициализаци€ фильтра низкой частоты на 10 √ц
//TDirectForm1 LPF10 = {34,34,32767,-32699,0,0};
// инициализаци€ фильтра низкой частоты на 100 √ц
//TDirectForm1 LPF100 = {340,340,32767,-32089,0,0};
// инициализаци€ фильтра низкой частоты на 200 √ц
//TDirectForm1 LPF200 = {672,672,32767,-31423,0,0};
// инициализаци€ фильтра низкой частоты на 300 √ц
//TDirectForm1 LPF300 = {998,998,32767,-30771,0,0};
// инициализаци€ фильтра низкой частоты на 1000 √ц
//TDirectForm2 LPF1000 = {156,312,156,16384,-27644,12184};


//--------------------------------------------------------------
//‘¬„
// инициализаци€ фильтра высокой частоты на 100 √ц
//TDirectForm1 HPF100 = {32428,-32428,32767,-32089,0,0};
// инициализаци€ фильтра высокой частоты на 300 √ц
//TDirectForm1 HPF300 = {31770,-31770,32767,-30771,0,0};
// инициализаци€ фильтра высокой частоты на 200 √ц
//TDirectForm1 HPF200 = {32095,-32096,32767,-31424,0,0};
// инициализаци€ фильтра высокой частоты 800 √ц
TDirectForm1 HPF800 = {30230, -30230, 32767, -27691, 0, 0};


//--------------------------------------------------------------
// режекторные
// инициализаци€ режекторного фильтра 1300...1700 √ц
//TDirectForm2 BSPF1500 = {15725,-29937,15725,16384,-29937,15066,0,0,0,0};
// инициализаци€ режекторного фильтра 1525...1800 √ц
//TDirectForm2 BSPF1700 = {15925,-29952,15925,16384,-29952,15467,0,0,0,0};
// инициализаци€ режекторного фильтра 1535...1805 √ц
//TDirectForm2 BSPF1670 = {16384,-30796,16384,16384,-29949,15483,0,0,0,0};
// инициализаци€ режекторного фильтра 1595...1865 √ц
//TDirectForm2 BSPF1730 = {15933,-29810,15933,16384,-29810,15483,0,0,0,0};
// инициализаци€ режекторного фильтра 1595...2000 √ц
//TDirectForm2 BSPF1797 = {15285,-28454,15285,16384,-29259,15050,0,0,0,0};


// инициализаци€ режекторного фильтра 1000...2000 √ц
TDirectForm2 BSPF1000_2000K = {14826,-28356,14826,16384,-28356,13268,0,0,0,0};
// инициализаци€ режекторного фильтра 1250...2250 √ц
TDirectForm2 BSPF1250_2250K = {14826,-27835,14826,16384,-27835,13268,0,0,0,0};
// инициализаци€ режекторного фильтра 1500...2500 √ц
TDirectForm2 BSPF1500_2500K = {14826,-27237,14826,16384,-27237,13268,0,0,0,0};


//
