//***************  рабочая область *****************************************
#define ADDR_BOOT			0x08000000		// загрузчик
#define ADDR_CRC_BOOT		0x08000FFC		// crc загрузчика
#define ADDR_WORK_ENTRY		0x08001000		// рабочий код
#define ADDR_BACKUP_BOOT	0x08011000		// резервная копия загрузчика
#define ADDR_SIGN_REPROG	0x08012000		// 4 адрес признака перепрограммирования
#define ADDR_LEN_FWR		0x08012004 		// 4 длина прошивки
#define ADDR_CRC_FWR		0x08012008		// 4 crc прошивки


//*************  информационная область *************************************
#define ADDR_CONFIG			0x08000000		 // конфигурация (угловые точки)
